# St7DeleteStoredResultUserEquation

Deletes a stored user defined equation.

long St7DeleteStoredResultUserEquation(long uID, long Entity, long Number)
Input Parameters
uID
Strand7 model file ID.
Entity
One of tyBEAM, tyPLATE or tyBRICK.
Number
User defined equation number for the specified entity.